# Week-07

In [1]:
# getwd() #ディレクトリ確認getwd() #ディレクトリ確認

In [2]:
# # setwd() に入れる Path は上記のディレクトリの下の data ファイル
# setwd("C:/Users/iiats/OneDrive/デスクトップ/１００本ノックチャレンジ/03_R_100_knocks/Questions/data") 
# getwd() #ディレクトリ確認

In [3]:
# DataFrameの準備
# 相対パスでデータを読み込む
df <- read.csv("./data/titanic3.csv", header=T)
df2 <- read.csv("./data/data1.csv", header=T)
df3 <- read.csv("./data/data1_2.csv", header=T)
df4 <- read.csv("./data/data1_3.csv", header=T)
df5 <- read.csv("./data/data2.csv", header=T, fileEncoding = "CP932")

# マージと連結(59 - 65)

In [4]:
# 【61】
# df2にdf3を内部結合し、df2に格納

# https://bioscryptome.t-ohashi.info/r/dataframe-bind/
df2 <- read.csv("./data/data1.csv", header=T)
df2 <- merge(df2, df3, by="name") 
df2

  name class English Mathmatics History Biology Physics
1 A    1     80      55         65      58      100
2 C    2     65      70         95      79       60
3 D    1     40      63         70      95       89
4 D    1     40      63         70      95       89
5 F    2     93      68         81      45       69

In [5]:
# 【62】
# df2にdf3を外部結合し、df2に格納

df2 <- read.csv("./data/data1.csv", header=T)
df2 <- merge(df2, df3, by="name", all=T) 
df2

   name class English Mathmatics History Biology Physics
1  A     1     80      55        65      58      100
2  B     1     55     100        83      NA       NA
3  B     1     55     100        83      NA       NA
4  C     2     65      70        95      79       60
5  D     1     40      63        70      95       89
6  D     1     40      63        70      95       89
7  E     2     76      82        79      NA       NA
8  F     2     93      68        81      45       69
9  G     1    100      85        52      NA       NA
10 H     2     73      52        96      NA       NA
11 I    NA     NA      NA        NA      63       91
12 J    NA     NA      NA        NA      87       76
13 K    NA     NA      NA        NA      73       83

In [6]:
# 【63】
# df2とdf4を列方向に連結し、df2に格納

In [7]:
df4

   name Biology Physics
1  A    58      100
2  B    80       63
3  C    79       60
4  D    95       89
5  E    68       55
6  F    45       69
7  G    52       68
8  H    89       70
9  B    61       64
10 D    95       89

In [8]:
# https://webbeginner.hatenablog.com/entry/2015/02/06/132256
df2 <- read.csv("./data/data1.csv", header=T)
df2 <- cbind(df2, df4)
df2

   name class English Mathmatics History name Biology Physics
1  A    1      80      55        65      A    58      100
2  B    1      55     100        83      B    80       63
3  C    2      65      70        95      C    79       60
4  D    1      40      63        70      D    95       89
5  E    2      76      82        79      E    68       55
6  F    2      93      68        81      F    45       69
7  G    1     100      85        52      G    52       68
8  H    2      73      52        96      H    89       70
9  B    1      55     100        83      B    61       64
10 D    1      40      63        70      D    95       89

In [9]:
# 【64】
# df2とdf4を列方向に連結後、重複している
# name列の片方を削除し、df2に格納

# https://webbeginner.hatenablog.com/entry/2015/02/06/132256
df2 <- read.csv("./data/data1.csv", header=T)
df2 <- cbind(df2, df4)
df2 <- df2[, c(-6)]
df2

   name class English Mathmatics History Biology Physics
1  A    1      80      55        65      58      100
2  B    1      55     100        83      80       63
3  C    2      65      70        95      79       60
4  D    1      40      63        70      95       89
5  E    2      76      82        79      68       55
6  F    2      93      68        81      45       69
7  G    1     100      85        52      52       68
8  H    2      73      52        96      89       70
9  B    1      55     100        83      61       64
10 D    1      40      63        70      95       89

In [10]:
# 【65】
# df2とdf2を行方向に連結し、df2に格納

# https://webbeginner.hatenablog.com/entry/2015/02/06/132256
df2 <- read.csv("./data/data1.csv", header=T)
df2 <- rbind(df2, df2)
df2

   name class English Mathmatics History
1  A    1      80      55        65
2  B    1      55     100        83
3  C    2      65      70        95
4  D    1      40      63        70
5  E    2      76      82        79
6  F    2      93      68        81
7  G    1     100      85        52
8  H    2      73      52        96
9  B    1      55     100        83
10 D    1      40      63        70
11 A    1      80      55        65
12 B    1      55     100        83
13 C    2      65      70        95
14 D    1      40      63        70
15 E    2      76      82        79
16 F    2      93      68        81
17 G    1     100      85        52
18 H    2      73      52        96
19 B    1      55     100        83
20 D    1      40      63        70

# 統計 (66 - 79)

In [11]:
head(df)

  pclass survived name                                            sex    age
1 1      1        Allen, Miss. Elisabeth Walton                   female 29.00
2 1      1        Allison, Master. Hudson Trevor                  male    0.92
3 1      0        Allison, Miss. Helen Loraine                    female  2.00
4 1      0        Allison, Mr. Hudson Joshua Creighton            male   30.00
5 1      0        Allison, Mrs. Hudson J C (Bessie Waldo Daniels) female 25.00
6 1      1        Anderson, Mr. Harry                             male   48.00
  sibsp parch ticket fare     cabin   embarked boat body
1 0     0     24160  211.3375 B5      S        2     NA
2 1     2     113781 151.5500 C22 C26 S        11    NA
3 1     2     113781 151.5500 C22 C26 S              NA
4 1     2     113781 151.5500 C22 C26 S             135
5 1     2     113781 151.5500 C22 C26 S              NA
6 0     0     19952   26.5500 E12     S        3     NA
  home.dest
1 St Louis, MO
2 Montreal, PQ / Chesterville, ON
3 Montreal, PQ / Chesterville, ON
4 Montreal, PQ / Chesterville, ON
5 Montreal, PQ / Chesterville, ON
6 New York, NY

In [12]:
sum(is.na(df$age))

[1] 263

In [13]:
# age に欠損値がある行を削除
# http://sakananoiroiro.seesaa.net/article/452087020.html
df <- subset(df, !(is.na(df$age)))
sum(is.na(df$age))

[1] 0

In [14]:
# 【66】
# dfのage列の平均値を確認

# https://symfoware.blog.fc2.com/blog-entry-1512.html
mean(df$age)

[1] 29.88114

In [15]:
# 【67】
# dfのage列の中央値を確認

median(df$age)

[1] 28

In [16]:
# 【68】
# ①df2の生徒ごとの合計点（行方向の合計）
# ②df2の科目ごとの点数の総和（列方向の合計）

df2 <- read.csv("./data/data1.csv", header=T)
df2 <- df2[, c(-1, -2)]

# http://cse.naro.affrc.go.jp/takezawa/r-tips/r/21.html
print("①df2の生徒ごとの合計点（行方向の合計）")
print(apply(df2, 1, sum))
print("=============================================")
print("②df2の科目ごとの点数の総和（列方向の合計）")
print(apply(df2, 2, sum))

[1] "①df2の生徒ごとの合計点（行方向の合計）"
 [1] 200 238 230 173 237 242 237 221 238 173
[1] "============================================="
[1] "②df2の科目ごとの点数の総和（列方向の合計）"
   English Mathmatics    History
       677        738        774

In [17]:
# 【69】
# df2のEnglishで得点の最大値

max(df2$English)

[1] 100

In [18]:
# 【70】
# df2のEnglishで得点の最小値

min(df2$English)

[1] 40